nc: 2  # number of classes

scales: # model compound scaling constants, i.e. 'model=yolov8n-seg.yaml' will call yolov8-seg.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.25, 0.23, 1024]
backbone:
  # 使用较少的过滤器和模块重复次数
  - [-1, 1, Conv, [32, 3, 2]]        #  0    32 320*320              输入图像尺寸缩小，减少特征图通道数
  - [-1, 1, Conv, [64, 3, 2]]        #  1    64 160*160
  - [-1, 1, C2f, [64, True]]         #  2    64 160*160
  - [-1, 1, Conv, [128, 3, 2]]       #  3    128 80*80
  - [-1, 1, C2f, [128, True]]        #  4    128 80*80
  - [-1, 1, Conv, [256, 3, 2]]       #  5    256 40*40
  - [-1, 1, C2f, [256, True]]        #  6    256 40*40
  - [-1, 1, SPPF, [256, 5]]          #  7    256 40*40    简化的空间金字塔池化层

head:
  # 只使用必要的上采样层和连接层，减少特征图的合并
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #  8  *    256  80*80          p1
  - [[-1, 4], 1, Concat, [1]]                   # 9       384  80*80           参数减少：合并P3的特征图
  - [-1, 1, C2f, [256,True]]                    #  10 *   128  80*80          p2
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  #  11     128  160*160
  - [[-1, 2], 1, Concat, [1]]                   #  12     192  160*160                  参数减少：合并P2的特征图
  - [-1, 1, C2f, [64]]                          #  13 *   64  160*160        p3         减少特征图的通道数到64   student2_train2保存的为ch：64，模型大小进一步缩小到1.4M
  - [-1, 1, CBAM,[]]                            #  14  attention
  #- [-1, 1, H_MAx_C_MaxAtt,[]]
  #- [-1, 1, HCAtt_Max,[]]
  # - [-1, 1, ECA,[]]
  #- [-1, 1, GAM,[]]    #14
  #- [-1, 1, CoordAtt,[]]
  - [7, 1, C2f, [512, True]]  #        512  40*40  15
  # 简化分割层
  - [[10,14,15], 1, Segment, [nc, 32, 128]]           #  16            使用较少的卷积核进行分割